bobonit-hub/freyaos/coprocessor/esp32c6/board/mpconfigboard.h
// Freya ESP32-C6 coprocessor: generic module with 4 MiB or more flash.

#define MICROPY_HW_BOARD_NAME "Freya ESP32-C6 coprocessor"
#define MICROPY_HW_MCU_NAME "ESP32C6"
#define MICROPY_HW_ENABLE_UART_REPL (1)
